HELYXcore-4.4.0/examples/legacy/heatTransfer/buoyantSimpleFoam/hotRadiationRoomFvDOM/0/k
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    box
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    floor
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    ceiling
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    fixedWalls
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
