HELYXcore-4.4.0/examples/legacy/heatTransfer/buoyantSimpleFoam/hotRadiationRoomFvDOM/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication $(getApplication)

#------------------------------------------------------------------------------
